import React from 'react';

const TextSection = () => {
    return (

        <div className="w-1/3 p-4 flex flex-col bg-SubStyleLight dark:bg-SubStyleDark rounded-lg m-2">
            <div className="relative flex justify-center mb-4 p-5">
                <img
                    src="/logo.png"
                    alt="Изображение пользователя"
                    className="w-32 h-32 object-cover rounded-lg shadow-md"
                />
            </div>
            <h2 className="text-2xl font-bold mb-4">История колледжа</h2>
            <p className="text-black">
                В колледже НАТК, основанном в 1929 году, студенты с энтузиазмом осваивают авиационные технологии. Каждый
                день они погружаются в мир знаний, участвуя в практических занятиях и конкурсах, мечтая о карьере в
                авиации и внося свой вклад в будущее отрасли.В колледже НАТК студенты не только учатся, но и создают
                дружеские связи. На ежегодном фестивале талантов они показывают свои умения: от музыкальных выступлений
                до инженерных проектов, вдохновляя друг друга на новые достижения.

                Каждую весну в колледже проходит день открытых дверей, где будущие абитуриенты могут познакомиться с
                преподавателями и студентами. Это событие наполняет атмосферу колледжа радостью и ожиданием, ведь многие
                из них мечтают стать частью этой дружной авиационной семьи. Студенты колледжа НАТК активно участвуют в
                научных конференциях, где представляют свои исследования и проекты. Это помогает им развивать
                критическое мышление и навыки публичных выступлений, что является важным аспектом их подготовки к
                будущей профессии.

                Кроме того, колледж сотрудничает с различными авиационными компаниями, предоставляя студентам
                возможность проходить стажировки и получать практический опыт. Это сотрудничество открывает двери для
                трудоустройства и помогает студентам лучше понять требования отрасли.

                В колледже также активно развиваются спортивные секции, где студенты могут проявить свои таланты в
                различных видах спорта. Это способствует не только физическому развитию, но и укреплению командного духа
                среди студентов.
            </p>
        </div>
    );
};

export default TextSection;